{
  "backend/main.mo": "Main Motoko actor for the store backend, defining data types (Product, Category, Order, etc.) and CRUD endpoints for products, categories, orders, user profiles, contact forms, newsletter subscribers, shipping rates, hero section, and social links with role-based access control.",
  "backend/migration.mo": "Simple migration module that passes the existing shipping rates state through unchanged as a no-op migration.",
  "feature_evidence.json": "Feature evidence report linking the AdminDashboardPage admin-check re-evaluation fix (after Internet Identity login) to the file `useAdminCheck.ts` with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, covering pages, components, hooks, and contexts.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, accent, etc.) used throughout the UI.",
  "frontend/index.html": "Minimal HTML entry point titled 'Store' that mounts the React app into a `#root` div and loads `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (shop, product, cart, checkout, payment, admin sub-pages, legal pages) wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/CategoryForm.tsx": "Form component for creating or editing a category, with name and description fields, using `useAddCategory`/`useUpdateCategory` hooks and toast notifications.",
  "frontend/src/components/CategoryList.tsx": "Displays a sorted list of categories with edit and delete actions, including a confirmation dialog before deletion via `useDeleteCategory`.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a newsletter signup form and dynamic social media links (YouTube, Instagram, TikTok, Twitch, Kick) fetched from the backend.",
  "frontend/src/components/Header.tsx": "Sticky site header with desktop and mobile navigation links (Home, Shop, Contact) and a cart icon showing the current item count.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with CartProvider, Header, Footer, and a main content outlet.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on auth state changes.",
  "frontend/src/components/ProductForm.tsx": "Admin form for creating and editing products, supporting name, description, price, category, sizes, colors, and image uploads with progress tracking.",
  "frontend/src/components/ProductList.tsx": "Admin product list with search and category filter, displaying product cards with edit and delete actions including a confirmation dialog.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ShopDropdown.tsx": "Empty file with no content.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart state (items persisted to localStorage) with add, remove, update quantity, clear, and total/count helpers.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous backend actor, invalidating dependent queries whenever the identity or actor changes.",
  "frontend/src/hooks/useAdminCheck.ts": "React Query hook that checks if the currently authenticated user is an admin, invalidating the cache on identity changes to handle bootstrap admin assignment.",
  "frontend/src/hooks/useCategories.ts": "Provides React Query hooks for fetching, adding, updating, deleting, and reordering categories via the backend actor.",
  "frontend/src/hooks/useContactForm.ts": "Provides hooks for submitting a contact form (mutation) and retrieving all submitted contact forms (query) via the backend actor.",
  "frontend/src/hooks/useHeroSection.ts": "Provides hooks to fetch and update the hero section content via the backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and status flags.",
  "frontend/src/hooks/useNewsletter.ts": "Provides hooks for subscribing an email to the newsletter (mutation) and fetching all newsletter subscribers (query) via the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for fetching all orders, fetching a single order, creating orders, and updating order status and cost via the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for fetching, adding, updating, deleting, and reordering products via the backend actor.",
  "frontend/src/hooks/useShipping.ts": "React Query hook that calculates shipping cost for a given destination and product list via the backend actor.",
  "frontend/src/hooks/useSocialLinks.ts": "Provides hooks to fetch and update social links via the backend actor using React Query.",
  "frontend/src/hooks/useStripeCheckout.ts": "Mutation hook that creates a Stripe checkout session via the backend actor, returning the session ID and redirect URL.",
  "frontend/src/hooks/useUserProfile.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for a dark-themed design system, plus a float animation utility.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin page that displays total revenue, total costs, and profit calculated from all orders in a card grid layout.",
  "frontend/src/pages/AdminCategoriesPage.tsx": "Admin page for managing product categories, displaying a list with edit/delete actions and a dialog form for creating or editing categories.",
  "frontend/src/pages/AdminContactFormsPage.tsx": "Admin page that fetches and displays all contact form submissions in cards, showing name, email, message, and timestamp.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard landing page that handles authentication and admin-role verification via Internet Identity, showing appropriate states (loading, login prompt, access denied, or dashboard links).",
  "frontend/src/pages/AdminHeroSectionPage.tsx": "Admin page for editing the homepage hero section, allowing updates to headline, tagline, and background image with upload progress tracking.",
  "frontend/src/pages/AdminNewsletterPage.tsx": "Admin page that lists newsletter subscribers in a table and provides a CSV export button using a utility function.",
  "frontend/src/pages/AdminOrderDetailPage.tsx": "Admin page for viewing a single order's details, with controls to update order status, update Printify cost, and copy formatted order data to the clipboard.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page listing all orders sorted by date, showing key details per order with a link to the individual order detail page.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing products, displaying a product list with edit support and a dialog form for creating or editing products with category data.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Admin page for managing social media links (YouTube, Instagram, TikTok, Twitch, Kick) with form inputs that load existing values and save updates via a mutation hook.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls and a remove button, plus an order summary sidebar with total price.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that collects shipping address and shipping method selection, calculates order total, and stores checkout data in sessionStorage before navigating to the payment page.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with name, email, and message fields that submits to the backend via a mutation hook and shows success/error toasts.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section with a configurable headline, tagline, and background image, followed by a grid of up to four featured products.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Static page shown after a failed or cancelled payment, informing the user their cart is preserved and providing links back to the cart and shop.",
  "frontend/src/pages/PaymentPage.tsx": "Payment page that reads checkout data from sessionStorage, builds a list of Stripe line items including shipping, and redirects the user to a Stripe-hosted checkout session URL.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation page that clears the cart and checkout session data on mount, with links to return home or continue shopping.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page rendering the site's privacy policy covering data collection, usage, payment processing, newsletter, admin auth, security, and retention.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches a product by ID, displays images with a thumbnail gallery, and allows users to select size, color, and quantity before adding to cart.",
  "frontend/src/pages/RefundPolicyPage.tsx": "Static page displaying the store's no-refund policy, explaining the print-on-demand model and limited exceptions for defective products.",
  "frontend/src/pages/ShippingReturnsPage.tsx": "Static page outlining shipping timeframes by region (US, Canada, Australia, rest of world), international customs responsibilities, and the no-returns policy.",
  "frontend/src/pages/ShopPage.tsx": "Shop listing page that fetches products and categories, supports horizontal pill-style category filtering, and renders products in a responsive grid with links to detail pages.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Static page presenting the site's terms of service covering acceptance, age requirements, final sale policy, pricing, order processing, shipping, and liability.",
  "frontend/src/utils/exportCSV.ts": "Utility function that converts an array of objects to a CSV string and triggers a browser file download with the specified filename.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state for a Streetwear Store app, recording existing features, pending fix requests (AR-1, AR-2) related to first-user admin bootstrap, and known issues around access denial on first admin login."
}