{
  "backend/main.mo": "Main backend actor defining e-commerce types (Product, Order, Category, Address, HeroSection, SocialLinks) and CRUD operations with admin authorization, blob storage mixins, and migration support.",
  "backend/migration.mo": "Migration module that transforms old actor state to new state by adding heroSection and socialLinks fields while preserving existing data structures.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: removal of customer account system, privacy policy updates, and terms of service updates for guest-only checkout.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and contexts for the e-commerce application with admin dashboard and guest checkout.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (shop, admin, legal pages, checkout flow) wrapped in ThemeProvider with Toaster notifications.",
  "frontend/src/components/Footer.tsx": "Footer component with newsletter signup form, social media links (YouTube, Instagram, TikTok, Twitch, Kick), and a \"Made with Love\" attribution section. Handles newsletter subscription via form submission and displays social links fetched from backend.",
  "frontend/src/components/Header.tsx": "Header component with sticky navigation bar containing logo, navigation links (Home, Shop, Contact), login button, shopping cart icon with item count badge, and responsive mobile menu toggle.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the application with CartProvider and renders Header, main content outlet, and Footer in a flex column layout.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states using Internet Identity, handles authentication errors, and clears query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ShopDropdown.tsx": "Empty file with no content.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart state management with localStorage persistence, including functions to add/remove/update items, calculate totals, and track item counts. Cart items include product, size, color, and quantity.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCategories.ts": "React Query hooks for category CRUD operations (get, add, update, delete) that interact with the backend actor and manage query cache invalidation.",
  "frontend/src/hooks/useContactForm.ts": "React Query hooks for submitting contact forms and fetching all contact form submissions from the backend actor.",
  "frontend/src/hooks/useHeroSection.ts": "React Query hooks for fetching and updating the hero section content on the homepage, with automatic cache invalidation on updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, delegation validation, and AuthClient lifecycle with configurable options for idle handling and identity provider.",
  "frontend/src/hooks/useNewsletter.ts": "React Query mutation hook for newsletter signup that currently uses the contact form backend endpoint as a workaround to store email subscriptions.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for order operations including fetching all orders, fetching a single order, creating orders, and updating order status and cost.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for product CRUD operations: fetching products, adding, updating, and deleting products with automatic cache invalidation.",
  "frontend/src/hooks/useShipping.ts": "Provides a React Query hook to calculate shipping costs based on destination and products list.",
  "frontend/src/hooks/useSocialLinks.ts": "Provides React Query hooks for fetching and setting social media links with cache invalidation.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook to create Stripe checkout sessions with success and cancel URLs based on shopping items.",
  "frontend/src/hooks/useUserProfile.ts": "Empty file with no content.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming (colors, radius, etc.) and a float animation utility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AccountPage.tsx": "Empty file with no content.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Displays analytics dashboard showing total revenue, costs, and profit calculated from all orders.",
  "frontend/src/pages/AdminCategoriesPage.tsx": "Placeholder page for category management with a coming soon message.",
  "frontend/src/pages/AdminContactFormsPage.tsx": "Displays all contact form submissions with name, email, message, and timestamp in card format.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with navigation cards to various admin sections (products, orders, analytics, etc.) with authentication and authorization checks.",
  "frontend/src/pages/AdminHeroSectionPage.tsx": "Admin page for editing hero section content including headline, tagline, and image with upload progress tracking using ExternalBlob.",
  "frontend/src/pages/AdminNewsletterPage.tsx": "Placeholder page for newsletter subscriber management with a coming soon message.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Displays all orders in a list with order details including customer info, total, date, and status badge.",
  "frontend/src/pages/AdminProductsPage.tsx": "Placeholder page for product management with a coming soon message.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Admin page for managing social media links (YouTube, Instagram, TikTok, Twitch, Kick) with form inputs and authentication check.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, remove functionality, and order summary with checkout button.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with shipping information form, country-based shipping options calculation, and navigation to payment page.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with name, email, and message fields that submits to backend via useSubmitContactForm hook.",
  "frontend/src/pages/HomePage.tsx": "Landing page with customizable hero section and featured products grid linking to shop and product detail pages.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Empty file placeholder for order history functionality.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error message with options to return to cart or continue shopping.",
  "frontend/src/pages/PaymentPage.tsx": "Payment processing page that creates Stripe checkout session with cart items and shipping, then redirects to Stripe.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a success message after payment completion, clears the cart and checkout data from session storage, and provides navigation buttons to return home or continue shopping.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page displaying the privacy policy with sections covering information collection, usage, payment processing via Stripe, newsletter subscriptions, admin authentication via Internet Identity, data security, and retention policies.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing product images, description, price, size/color selection, quantity picker, and add-to-cart functionality with validation for required selections.",
  "frontend/src/pages/RefundPolicyPage.tsx": "Static page explaining the no-refunds policy for print-on-demand products, with exceptions for defective items within 7 days of delivery.",
  "frontend/src/pages/ShippingReturnsPage.tsx": "Static page detailing shipping timeframes for US, Canada, Australia, and international orders, plus information about customs duties and the no-returns policy with defective item exceptions.",
  "frontend/src/pages/ShopPage.tsx": "Main shop page displaying a filterable product grid with horizontal pill-style category navigation and product cards linking to detail pages.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Static page outlining terms of service including age requirements, final sale policy, product descriptions, pricing, order processing, shipping, and liability limitations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a streetwear e-commerce platform with guest-only checkout, admin dashboard, Printify fulfillment, dynamic shipping calculator, Stripe payments, and Internet Identity admin authentication on Internet Computer."
}